"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections.

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple


count_campany = int(input('Введите количество фирм: '))
all_comp = {}



for i in range(count_campany):
    COM = namedtuple('Company', 'name_company I II III IV')
    name_company = input('\nВведите название фирмы: ')
    I = int(input('Введите прибыль фирмы за первый квартал: '))
    II = int(input('Введите прибыль фирмы за второй квартал: '))
    III = int(input('Введите прибыль фирмы за третий квартал: '))
    IV = int(input('Введите прибыль фирмы за четвертый квартал: '))
    COM = COM(name_company, I, II, III, IV)
    all_comp[COM.name_company] = sum([COM.I, COM.II, COM.III, COM.IV])/4

# print(all_comp)
average_income = sum(all_comp.values())/len(all_comp)
# print(average_income)
above_average = ''
below_average = ''
for i, j in all_comp.items():
    if j < average_income:
        below_average += i + ', '
    elif j >= average_income:
        above_average += i + ', '
print(f'\nСредняя прибыль компаний: {average_income}')
print(f'Компании с прибылью выше среднего: {above_average}')
print(f'Компании с прибылью ниже среднего: {below_average}')